Tekla Open API Reference for Tekla Structures 2025
RebarSplice Constructor
Overload List
Name | Description
RebarSplice()
 Initializes a new rebar splice instance.
RebarSplice(RebarGroup, RebarGroup)
 Initializes a new rebar splice instance with rebar groups to be joined.
Top
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace